class Messages:
    WELCOME = "Приветствую! Нажмите кнопку, чтобы получить случайную статью"
    SOURCES_MANAGEMENT = "Нажмите одну из кнопок ниже, чтобы добавить или удалить источник"
    UNKNOWN = "Сообщение не распознано"
    ERROR = "Что-то пошло не так, пожалуйста повторите попытку"


class Buttons:
    GET_ARTICLE = "Получить статью"
    MANAGE_SOURCES = "Управление источниками"
    ADD_SOURCE = "Добавить источник"
    REMOVE_SOURCE = "Удалить источник"
    BACK_TO_MAIN = "На главный экран"
